net.vandut.agh.magisterka/java-client/src/main/resources/net/vandut/agh/magisterka/logic/service/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:tns="http://service.logic.magisterka.agh.vandut.net/">
  <env:Body>
    <tns:logic_status/>
  </env:Body>
</env:Envelope>
